Revit 2024 API
MEPNetworkIterator Methods
The MEPNetworkIterator type exposes the following members.
Methods
Name | Description
Dispose
End
 Checks if the network iteration has completed.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAnalyticalModelData
 Gets the analytical model data at the current iteration step.
GetAnalyticalNode
 Gets the analytical node at the current iteration step.
GetAnalyticalSegment
 Gets the analytical segment at the current iteration step.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetOtherAnalyticalNode
 Gets the other analytical node at the current iteration step.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Next
 Moves this iterator to the next step of network iteration.
Start
 Gets the first step of network iteration.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace